tests/phpunit/includes/Responses/amazon/setBillingAgreementDetails.json

{
    "SetBillingAgreementDetailsResult": {
        "BillingAgreementDetails": {
            "AmazonBillingAgreementId": "C01-9650293-7351908",
            "BillingAgreementStatus": {
                "State": "Draft"
            },
            "BillingAgreementConsent": "true",
            "SellerBillingAgreementAttributes": {
                "SellerBillingAgreementId": "36834-1"
            },
            "ReleaseEnvironment": "Sandbox",
            "SellerNote": "Wikimedia Foundation - monthly gift",
            "CreationTimestamp": "2015-10-05T18:06:38.940Z",
            "BillingAgreementLimits": {
                "TimePeriodStartDate": "2015-10-01T00:00:00Z",
                "CurrentRemainingBalance": {
                    "CurrencyCode": "USD",
                    "Amount": "500.00"
                },
                "AmountLimitPerTimePeriod": {
                    "CurrencyCode": "USD",
                    "Amount": "500"
                },
                "TimePeriodEndDate": "2015-11-01T00:00:00Z"
            }
        }
    },
    "ResponseMetadata": {
        "RequestId": "9a92b3f8-d8d2-46bf-b998-e3332c71df61"
    },
    "ResponseStatus": "200"
}
